window.LEVELS=[
  {
    "title": "先走一步",
    "subtitle": "你走这一拍，伙伴走上一拍。",
    "map": [
      "....",
      "....",
      "...."
    ],
    "a": [
      0,
      1
    ],
    "b": [
      0,
      2
    ],
    "ga": [
      3,
      1
    ],
    "gb": [
      2,
      2
    ],
    "swap": false,
    "solution": [
      "R",
      "R",
      "R"
    ],
    "baseline": 3,
    "par": 3
  },
  {
    "title": "借墙等一等",
    "subtitle": "碰墙也算一拍。你停下来，伙伴还能继续。",
    "map": [
      "....",
      "....",
      "...."
    ],
    "a": [
      0,
      0
    ],
    "b": [
      0,
      2
    ],
    "ga": [
      3,
      0
    ],
    "gb": [
      3,
      2
    ],
    "swap": false,
    "solution": [
      "R",
      "R",
      "R",
      "U"
    ],
    "baseline": 4,
    "par": 4
  },
  {
    "title": "绕路的默契",
    "subtitle": "两人的路不同。看一眼伙伴的箭头再出发。",
    "map": [
      "....#",
      ".#.##",
      "....#",
      "....#",
      "....."
    ],
    "a": [
      4,
      4
    ],
    "b": [
      3,
      4
    ],
    "ga": [
      0,
      4
    ],
    "gb": [
      2,
      4
    ],
    "swap": false,
    "solution": [
      "U",
      "U",
      "L",
      "U",
      "L",
      "L",
      "D",
      "D",
      "D",
      "L"
    ],
    "baseline": 10,
    "par": 10
  },
  {
    "title": "换你来",
    "subtitle": "靠近后交棒，旧箭头交给新的跟随者。",
    "map": [
      "....",
      "....",
      "...."
    ],
    "a": [
      0,
      1
    ],
    "b": [
      1,
      1
    ],
    "ga": [
      1,
      1
    ],
    "gb": [
      2,
      0
    ],
    "swap": true,
    "solution": [
      "X",
      "R",
      "U"
    ],
    "baseline": 4,
    "par": 3
  },
  {
    "title": "并肩的岔路",
    "subtitle": "同一条路，换个人带，会发生什么？",
    "map": [
      "....#",
      ".#.##",
      "....#",
      "....#",
      "....."
    ],
    "a": [
      4,
      4
    ],
    "b": [
      3,
      4
    ],
    "ga": [
      0,
      4
    ],
    "gb": [
      2,
      4
    ],
    "swap": true,
    "solution": [
      "U",
      "L",
      "L",
      "L",
      "X",
      "D",
      "R"
    ],
    "baseline": 10,
    "par": 7
  },
  {
    "title": "一起回家",
    "subtitle": "把箭头交给对方，也把回家的路留给对方。",
    "map": [
      "###..",
      ".....",
      ".....",
      "....."
    ],
    "a": [
      2,
      1
    ],
    "b": [
      4,
      2
    ],
    "ga": [
      4,
      3
    ],
    "gb": [
      1,
      2
    ],
    "swap": true,
    "solution": [
      "R",
      "D",
      "X",
      "L",
      "X",
      "D",
      "L",
      "R"
    ],
    "par": 8,
    "baseline": 11
  }
];
